//import './scss/styles.scss';
import './modules/datetime';
import './modules/greeting';
import './modules/slider-bg';
import './modules/weather';
import './modules/quotes';
import './modules/audio';
import './modules/language';
import './modules/settings';
import './modules/my-links';

console.log(`
Выполнено полностью:
1. Часы и календарь +15
2. Приветствие +10
3. Смена фонового изображения +20
4. Виджет погоды +15
5. Виджет цитата дня +10
6. Аудиоплеер +15
7. Продвинутый аудиоплеер +20
8. Перевод приложения на два языка (en/ru или en/be) +15

Частично выполнено: 
9. Получение фонового изображения от API +5 (изображения приходят по API, но нет возможности перелистывания по стрелкам)
10. Настройки приложения +16
- невозможно указать тег/теги, для которых API будет присылает фото
- настройки блоков не сохраняются при перезагрузке страницы

Не выполнено:
11. Дополнительный функционал на выбор

Кнопка с настройками в нижнем правом углу)
Желаю успехов в прохождении курса!
`);
